{
    "title": {
        "en": "Wikibase autocomplete search",
        "es": "Búsqueda por autocompletación en Wikidata"
    },
    "loading": {
        "en": "Loading results",
        "es": "Cargando resultados"
    },
    "search-results-title": {
        "en": "Search results",
        "es": "Resultados de la búsqueda"
    },
    "go-back": {
        "en": "← Go back",
        "es": "← Ir atrás"

    },
    "query": {
        "en": "Search",
        "es": "Buscar"
    },
    "wikidata-query": {
        "en": "Wikidata query",
        "es": "Consulta en Wikidata"
    },
    "cont-question-title": {
        "en": "Contingent question:",
        "es": "Pregunta contingente:"
    },
    "qawiki-link": {
        "en": "View question in QAWiki",
        "es": "Ver pregunta en QAWiki"
    },
    "wikidata-query-link": {
        "en": "View query in Wikidata Query Service",
        "es": "Ver consulta en Servicio de Consultas de Wikidata"
    },
    "update-link": {
        "en": "Update template",
        "es": "Actualizar plantilla"
    },
    "about-link": {
        "en": "About Templet",
        "es": "Sobre Templet"
    },
    "about-text": {
        "en": "Templet (an alternative way of writing <i>template</i>) is a system developed by Francisca Suárez, with the guidance of Professor Aidan Hogan, in the context of the work <i>Autocompleting questions on Wikidata</i>. It consists of a web platform of questions and answers, with a main natural language text input from the user, which is autocompleted to guide and predetermine the structure of the query. This autocomplete is fed from the collection of questions available at <a href='' onclick ='location.href=qaWikiHomeUrl;return false;' target='_blank'>QAWiki</a>, previously transformed into templates. For example, the question <i>Who played the character Eleven in Stranger Things?</i > (<a href='' onclick='location.href=qaWikiItemUrl + `Q11`;return false;' target='_blank'>Q11</a> on QAWiki) is transformed to <i>Who interpreted the character (... ) in (...)?</i>. Clicking on one of these templates displays a new form with a text input field for each template entity. These text entries refer directly to the Wikidata API and also have autocompletion, allowing the selection of new entities to replace in the question. Finally, the selected entities are mapped to the SPARQL query and it is executed in the Wikidata Query Service, obtaining the result.<br> <br>The motivation of this platform is to offer an interactive demo of QAWiki to users. In this way, its use and contribution can be expanded, achieving a broader and more diverse collection of pairs of questions and queries, which can be used, in the future, for training deep neural networks. <br><br>The system code is publicly available at <a href='' onclick='location.href=repoUrl' target='_blank'>Github</a>. If you find any problems or want new features, open an <i>issue</i> in the repository.",
        "es": "Templet (una forma alternativa de escribir <i>template</i>, plantilla en español) es un sistema desarrollado por Francisca Suárez, con la guía del profesor Aidan Hogan, en el contexto del trabajo de título <i>Autocompletando preguntas sobre Wikidata</i>. Consiste en una plataforma web de preguntas y respuestas, con una entrada principal de texto en lenguaje natural por parte del usuario, la cual es autocompletada para guiar y predeterminar la estructura de la consulta. Este autocompletado se alimenta de la colección de preguntas disponibles en <a href='' onclick='location.href=qaWikiHomeUrl;return false;' target='_blank'>QAWiki</a>, previamente transformadas en plantillas. Por ejemplo, la pregunta <i>¿Quién interpretó el carácter Eleven en Stranger Things?</i> (<a href='' onclick='location.href=qaWikiItemUrl + `Q11`;return false;' target='_blank'>Q11</a> en QAWiki) es transformada en <i>¿Quién interpretó el carácter (...) en (...)?</i>. Al cliquear en una de estas plantillas, se despliega un nuevo formulario con un campo de entrada de texto para cada entidad de la plantilla. Estas entradas de texto consultan directamente a la API de Wikidata y también poseen autocompletado, permitiendo la selección de nuevas entidades a reemplazar en la pregunta. Finalmente, se mapean las entidades seleccionadas a la consulta SPARQL y se ejecuta en el Servicio de Consultas de Wikidata, obteniendo el resultado. <br><br>La motivación de esta plataforma es ofrecer una demostración interactiva de QAWiki a los usuarios. De esta forma, se puede expandir su uso y contribución, logrando una colección más amplia y diversa de pares de preguntas y consultas, pudiendo ser utilizada, en un futuro, para el entrenamiento de redes neuronales profundas.<br><br>El código del sistema se encuentra de forma pública en <a href='' onclick='location.href=repoUrl' target='_blank'>Github</a>. Si encuentras algún problema o deseas nuevas features, abre un <i>issue</i> en el repositorio."
    }
}